tefilus/MBD_PMSM/FINAL/simulink/codeGeneration/sixstep_f28069mLaunchPad_closeLoop_ert_rtw/sixstep_f28069mLaunchPad_closeLoop.h
/*
 * File: sixstep_f28069mLaunchPad_closeLoop.h
 *
 * Code generated for Simulink model 'sixstep_f28069mLaunchPad_closeLoop'.
 *
 * Model version                  : 7.154
 * Simulink Coder version         : 23.2 (R2023b) 01-Aug-2023
 * C/C++ source code generated on : Sun Jul 13 00:02:47 2025
 *
 * Target selection: ert.tlc
 * Embedded hardware selection: Texas Instruments->C2000
 * Code generation objectives: Unspecified
 * Validation result: Not run
 */

#ifndef RTW_HEADER_sixstep_f28069mLaunchPad_closeLoop_h_
#define RTW_HEADER_sixstep_f28069mLaunchPad_closeLoop_h_
#ifndef sixstep_f28069mLaunchPad_closeLoop_COMMON_INCLUDES_
#define sixstep_f28069mLaunchPad_closeLoop_COMMON_INCLUDES_
#include "rtwtypes.h"
#include "c2000BoardSupport.h"
#include "F2806x_Device.h"
#include "F2806x_Gpio.h"
#include "DSP28xx_SciUtil.h"
#include "F2806x_Examples.h"
#include "IQmathLib.h"
#include "MW_SPI.h"
#endif                 /* sixstep_f28069mLaunchPad_closeLoop_COMMON_INCLUDES_ */

#include "MW_c2000ISR.h"
#include "sixstep_f28069mLaunchPad_closeLoop_types.h"
#include "ToLCD.h"
#include "rt_nonfinite.h"
#include "rtGetNaN.h"
#include <string.h>
#include <stddef.h>
#include "MW_target_hardware_resources.h"

/* Macros for accessing real-time model data structure */
#ifndef rtmGetErrorStatus
#define rtmGetErrorStatus(rtm)         ((rtm)->errorStatus)
#endif

#ifndef rtmSetErrorStatus
#define rtmSetErrorStatus(rtm, val)    ((rtm)->errorStatus = (val))
#endif

#ifndef rtmStepTask
#define rtmStepTask(rtm, idx)          ((rtm)->Timing.TaskCounters.TID[(idx)] == 0)
#endif

#ifndef rtmTaskCounter
#define rtmTaskCounter(rtm, idx)       ((rtm)->Timing.TaskCounters.TID[(idx)])
#endif

#define sixstep_f28069mLaunchPad_closeLoop_M (sixstep_f28069mLaunchPad_clo_M)

extern void init_SCI(void);
extern void init_SCI_GPIO(void);
extern void config_ePWM_GPIO (void);
extern void config_ePWM_TBSync (void);
extern void config_ePWM_XBAR(void);

/* Block signals for system '<S135>/SPI Master Transfer' */
typedef struct {
  uint16_T SPIMasterTransfer;          /* '<S135>/SPI Master Transfer' */
} rtB_SPIMasterTransfer_sixstep_f;

/* Block states (default storage) for system '<S135>/SPI Master Transfer' */
typedef struct {
  codertarget_tic2000_blocks_SPIM obj; /* '<S135>/SPI Master Transfer' */
  boolean_T objisempty;                /* '<S135>/SPI Master Transfer' */
} rtDW_SPIMasterTransfer_sixstep_;

/* Block signals for system '<Root>/Speed Control' */
typedef struct {
  real32_T Switch;                     /* '<S146>/Switch' */
  real32_T Product;                    /* '<S201>/Product' */
  real32_T UnitDelay;                  /* '<S201>/Unit Delay' */
  real32_T Product1;                   /* '<S201>/Product1' */
  real32_T Add1;                       /* '<S201>/Add1' */
  real32_T Sum;                        /* '<S145>/Sum' */
  real32_T PProdOut;                   /* '<S187>/PProd Out' */
  real32_T Ki2;                        /* '<S145>/Ki2' */
  real32_T Integrator;                 /* '<S182>/Integrator' */
  real32_T Sum_j;                      /* '<S191>/Sum' */
  real32_T DeadZone;                   /* '<S175>/DeadZone' */
  real32_T IProdOut;                   /* '<S179>/IProd Out' */
  real32_T Switch_a;                   /* '<S173>/Switch' */
  real32_T Saturation;                 /* '<S189>/Saturation' */
  int16_T Switch1;                     /* '<S173>/Switch1' */
  int16_T Switch2;                     /* '<S173>/Switch2' */
  boolean_T DataStoreRead2;            /* '<S145>/Data Store Read2' */
  boolean_T DataStoreRead1;            /* '<S146>/Data Store Read1' */
  boolean_T LogicalOperator;           /* '<S145>/Logical Operator' */
  boolean_T RelationalOperator;        /* '<S173>/Relational Operator' */
  boolean_T fixforDTpropagationissue;/* '<S173>/fix for DT propagation issue' */
  boolean_T fixforDTpropagationissue1;
                                    /* '<S173>/fix for DT propagation issue1' */
  boolean_T Equal1;                    /* '<S173>/Equal1' */
  boolean_T AND3;                      /* '<S173>/AND3' */
} rtB_SpeedControl_sixstep_f28069;

/* Block states (default storage) for system '<Root>/Speed Control' */
typedef struct {
  real32_T UnitDelay_DSTATE;           /* '<S201>/Unit Delay' */
  real32_T Integrator_DSTATE;          /* '<S182>/Integrator' */
  int16_T Integrator_PrevResetState;   /* '<S182>/Integrator' */
} rtDW_SpeedControl_sixstep_f2806;

/* Block signals (default storage) */
typedef struct {
  real_T cu[3];                        /* '<S102>/Switch' */
  real_T Merge1;                       /* '<S130>/Merge1' */
  real_T Sign;                         /* '<S130>/Sign' */
  real_T ADCThreshold;                 /* '<S129>/ADCThreshold' */
  real_T Sum;                          /* '<S129>/Sum' */
  uint32_T PositionToCount;            /* '<S107>/PositionToCount' */
  uint32_T Delay;                      /* '<S107>/Delay' */
  real32_T DataStoreRead;              /* '<Root>/Data Store Read' */
  real32_T RT1;                        /* '<Root>/RT1' */
  real32_T RT6;                        /* '<Root>/RT6' */
  real32_T RT3;                        /* '<Root>/RT3' */
  real32_T Abs;                        /* '<S11>/Abs' */
  real32_T RT2;                        /* '<Root>/RT2' */
  real32_T DataTypeConversion1[3];     /* '<S100>/Data Type Conversion1' */
  real32_T DataTypeConversion[3];      /* '<S102>/Data Type Conversion' */
  real32_T Sum_o;                      /* '<S100>/Sum' */
  real32_T IDC;                        /* '<S100>/Unary Minus' */
  real32_T toPU;                       /* '<S129>/toPU' */
  real32_T Limit;                      /* '<S129>/Limit' */
  real32_T conductSpeed;               /* '<S129>/conductSpeed' */
  real32_T Idc_ref;                    /* '<S15>/Abs' */
  real32_T Sum_c;                      /* '<S20>/Sum' */
  real32_T PProdOut;                   /* '<S61>/PProd Out' */
  real32_T Kp1;                        /* '<S20>/Kp1' */
  real32_T Integrator;                 /* '<S56>/Integrator' */
  real32_T Sum_e;                      /* '<S65>/Sum' */
  real32_T Sign_b;                     /* '<S15>/Sign' */
  real32_T DataStoreRead_c;            /* '<S16>/Data Store Read' */
  real32_T DeadZone;                   /* '<S49>/DeadZone' */
  real32_T IProdOut;                   /* '<S53>/IProd Out' */
  real32_T Switch;                     /* '<S47>/Switch' */
  real32_T DTC;                        /* '<S123>/DTC' */
  real32_T Product;                    /* '<S106>/Product' */
  real32_T DTC_a;                      /* '<S128>/DTC' */
  real32_T SpeedGain;                  /* '<S107>/SpeedGain' */
  real32_T Product_g;                  /* '<S110>/Product' */
  real32_T UnitDelay;                  /* '<S110>/Unit Delay' */
  real32_T Product1;                   /* '<S110>/Product1' */
  real32_T Add1;                       /* '<S110>/Add1' */
  real32_T Switch_f;                   /* '<S112>/Switch' */
  real32_T Merge;                      /* '<S113>/Merge' */
  real32_T Numberofpolepairs;          /* '<S118>/Number of pole pairs' */
  real32_T Floor;                      /* '<S114>/Floor' */
  real32_T Add;                        /* '<S114>/Add' */
  real32_T DataTypeConversion1_o[6];   /* '<S15>/Data Type Conversion1' */
  real32_T Saturation;                 /* '<S63>/Saturation' */
  real32_T duty[6];                    /* '<S15>/Product' */
  int32_T DataTypeConversion_b[3];     /* '<S100>/Data Type Conversion' */
  int32_T Add_g[3];                    /* '<S100>/Add' */
  int32_T Q17perunitconversion[3];     /* '<S100>/Q17 per unit conversion' */
  int32_T SpeedCount;                  /* '<S107>/SpeedCount' */
  uint16_T Divide;                     /* '<S134>/Divide' */
  uint16_T Divide1;                    /* '<S134>/Divide1' */
  uint16_T Divide2;                    /* '<S134>/Divide2' */
  uint16_T ForIterator;                /* '<S137>/For Iterator' */
  uint16_T IAIBMeasurement[2];         /* '<S137>/IA//IB Measurement' */
  uint16_T ICMeasurement;              /* '<S137>/IC Measurement' */
  uint16_T Memory;                     /* '<S144>/Memory' */
  uint16_T Sum_b;                      /* '<S144>/Sum' */
  uint16_T Memory1;                    /* '<S144>/Memory1' */
  uint16_T Sum1;                       /* '<S144>/Sum1' */
  uint16_T Memory2;                    /* '<S144>/Memory2' */
  uint16_T Sum2;                       /* '<S144>/Sum2' */
  uint16_T eQEP_o1;                    /* '<S19>/eQEP' */
  uint16_T eQEP_o2;                    /* '<S19>/eQEP' */
  uint16_T DataStoreRead_i;            /* '<S100>/Data Store Read' */
  uint16_T DataStoreRead1;             /* '<S100>/Data Store Read1' */
  uint16_T DataStoreRead2;             /* '<S100>/Data Store Read2' */
  uint16_T IAMeasurement;              /* '<S19>/IA Measurement' */
  uint16_T ICIBMeasurement[2];         /* '<S19>/IC//IB Measurement' */
  uint16_T speedRef_ADC;               /* '<S19>/speedRef_ADC' */
  uint16_T Switch1[6];                 /* '<S14>/Switch1' */
  uint16_T Output;                     /* '<S92>/Output' */
  uint16_T DataTypeConversion3[3];     /* '<S94>/Data Type Conversion3' */
  uint16_T SCI_Tx_Data[4];             /* '<S16>/Merge' */
  uint16_T SCI_Tx_Iteration;           /* '<S16>/Merge1' */
  uint16_T FixPtSum1;                  /* '<S97>/FixPt Sum1' */
  uint16_T FixPtSwitch;                /* '<S98>/FixPt Switch' */
  uint16_T Merge_g;                    /* '<S106>/Merge' */
  uint16_T Sum3;                       /* '<S120>/Sum3' */
  uint16_T Sum7;                       /* '<S120>/Sum7' */
  uint16_T IndexVector;                /* '<S99>/Index Vector' */
  uint16_T Add_gl;                     /* '<S99>/Add' */
  uint16_T Data[3];                    /* '<S93>/Data' */
  uint16_T Data_f[3];                  /* '<S95>/Data' */
  uint16_T Data_fw[3];                 /* '<S96>/Data' */
  uint16_T Scale_to_PWM_Counter_PRD[6];/* '<S14>/Scale_to_PWM_Counter_PRD' */
  int16_T DataTypeConversion_l[3];     /* '<S94>/Data Type Conversion' */
  int16_T WhileIterator;               /* '<S99>/While Iterator' */
  uint16_T Merge_e;                    /* '<S73>/Merge' */
  uint16_T ShiftArithmetic;            /* '<S89>/Shift Arithmetic' */
  uint16_T A;                          /* '<S89>/Bitwise AND1' */
  uint16_T ShiftArithmetic1;           /* '<S89>/Shift Arithmetic1' */
  uint16_T B;                          /* '<S89>/Bitwise AND2' */
  uint16_T C;                          /* '<S89>/Bitwise AND3' */
  int16_T Switch1_b;                   /* '<S47>/Switch1' */
  int16_T Switch2;                     /* '<S47>/Switch2' */
  boolean_T ONOFF_GPIO6;               /* '<S12>/ON//OFF_GPIO6' */
  boolean_T NOT;                       /* '<S133>/NOT' */
  boolean_T CWCCW_GPIO7;               /* '<S13>/CW//CCW_GPIO7' */
  boolean_T DataStoreRead_e;           /* '<S130>/Data Store Read' */
  boolean_T Enable;                    /* '<S14>/Enable' */
  boolean_T DataStoreRead1_l;          /* '<S20>/Data Store Read1' */
  boolean_T LogicalOperator;           /* '<S20>/Logical Operator' */
  boolean_T Merge_n[3];                /* '<S76>/Merge' */
  boolean_T Merge_k[6];                /* '<S77>/Merge' */
  boolean_T RelationalOperator;        /* '<S47>/Relational Operator' */
  boolean_T fixforDTpropagationissue; /* '<S47>/fix for DT propagation issue' */
  boolean_T fixforDTpropagationissue1;
                                     /* '<S47>/fix for DT propagation issue1' */
  boolean_T Equal1;                    /* '<S47>/Equal1' */
  boolean_T AND3;                      /* '<S47>/AND3' */
  boolean_T DataTypeConversion_j;      /* '<S89>/Data Type Conversion' */
  boolean_T DataTypeConversion1_d;     /* '<S89>/Data Type Conversion1' */
  boolean_T DataTypeConversion2;       /* '<S89>/Data Type Conversion2' */
  rtB_ToLCD_sixstep_f28069mLaunch ToLCD;/* '<Root>/ToLCD' */
  rtB_SpeedControl_sixstep_f28069 SpeedControl;/* '<Root>/Speed Control' */
  rtB_SPIMasterTransfer_sixstep_f SPIMasterTransfer1;/* '<S135>/SPI Master Transfer' */
  rtB_SPIMasterTransfer_sixstep_f SPIMasterTransfer;/* '<S135>/SPI Master Transfer' */
} BlockIO_sixstep_f28069mLaunchPa;

