tefilus/MBD_PMSM/FINAL/simulink/codeGeneration/sixstep_f28069mLaunchPad_closeLoop_ert_rtw/sixstep_f28069mLaunchPad_closeLoop.h
/* Block states (default storage) for system '<Root>' */
typedef struct {
  real_T Sum_DWORK1;                   /* '<S129>/Sum' */
  real32_T Integrator_DSTATE;          /* '<S56>/Integrator' */
  real32_T UnitDelay_DSTATE;           /* '<S110>/Unit Delay' */
  uint32_T Delay_DSTATE[20];           /* '<S107>/Delay' */
  volatile real32_T RT1_Buffer[2];     /* '<Root>/RT1' */
  volatile real32_T RT2_Buffer[2];     /* '<Root>/RT2' */
  real32_T desiredSpeed;               /* '<Root>/g_desiredSpeed' */
  real32_T idcSCI_B;                   /* '<Root>/g_idcSCI_B' */
  real32_T speedSCI_B;                 /* '<Root>/g_speedSCI_B' */
  volatile real32_T RT3_Buffer[2];     /* '<Root>/RT3' */
  int32_T DigitalOutput_FRAC_LEN;      /* '<S7>/Digital Output' */
  int32_T DigitalOutput_FRAC_LEN_g;    /* '<S135>/Digital Output' */
  int32_T Add_DWORK1[3];               /* '<S100>/Add' */
  int32_T DigitalOutput_FRAC_LEN_l;    /* '<S14>/Digital Output' */
  int32_T SpeedCount_DWORK1;           /* '<S107>/SpeedCount' */
  uint16_T Output_DSTATE;              /* '<S92>/Output' */
  volatile int16_T RT1_ActiveBufIdx;   /* '<Root>/RT1' */
  volatile int16_T RT1_semaphoreTaken; /* '<Root>/RT1' */
  volatile int16_T RT2_ActiveBufIdx;   /* '<Root>/RT2' */
  volatile int16_T RT3_ActiveBufIdx;   /* '<Root>/RT3' */
  volatile int16_T RT3_semaphoreTaken; /* '<Root>/RT3' */
  uint16_T IaOffset;                   /* '<Root>/g_IaOffset' */
  uint16_T IbOffset;                   /* '<Root>/g_IbOffset' */
  uint16_T IcOffset;                   /* '<Root>/g_IcOffset' */
  uint16_T Memory_PreviousInput;       /* '<S144>/Memory' */
  uint16_T Memory1_PreviousInput;      /* '<S144>/Memory1' */
  uint16_T Memory2_PreviousInput;      /* '<S144>/Memory2' */
  uint16_T CircBufIdx;                 /* '<S107>/Delay' */
  uint16_T Add_DWORK1_f;               /* '<S99>/Add' */
  int16_T Integrator_PrevResetState;   /* '<S56>/Integrator' */
  boolean_T Enable;                    /* '<Root>/g_Enable' */
  boolean_T readTorqueSign;            /* '<Root>/g_TorqueSign' */
  rtDW_ToLCD_sixstep_f28069mLaunc ToLCD;/* '<Root>/ToLCD' */
  rtDW_SpeedControl_sixstep_f2806 SpeedControl;/* '<Root>/Speed Control' */
  rtDW_SPIMasterTransfer_sixstep_ SPIMasterTransfer1;/* '<S135>/SPI Master Transfer' */
  rtDW_SPIMasterTransfer_sixstep_ SPIMasterTransfer;/* '<S135>/SPI Master Transfer' */
} D_Work_sixstep_f28069mLaunchPad;

/* Invariant block signals (default storage) */
typedef struct {
  const uint16_T Width;                /* '<S16>/Width' */
} ConstBlockIO_sixstep_f28069mLau;

/* Constant parameters (default storage) */
typedef struct {
  /* Pooled Parameter (Mixed Expressions)
   * Referenced by:
   *   '<S90>/SA1'
   *   '<S91>/SA2'
   */
  boolean_T pooled13[8];

  /* Pooled Parameter (Mixed Expressions)
   * Referenced by:
   *   '<S90>/SA2'
   *   '<S91>/SA1'
   */
  boolean_T pooled14[8];

  /* Pooled Parameter (Mixed Expressions)
   * Referenced by:
   *   '<S90>/SB1'
   *   '<S91>/SB2'
   */
  boolean_T pooled15[8];

  /* Pooled Parameter (Mixed Expressions)
   * Referenced by:
   *   '<S90>/SB2'
   *   '<S91>/SB1'
   */
  boolean_T pooled16[8];

  /* Pooled Parameter (Mixed Expressions)
   * Referenced by:
   *   '<S90>/SC1'
   *   '<S91>/SC2'
   */
  boolean_T pooled17[8];

  /* Pooled Parameter (Mixed Expressions)
   * Referenced by:
   *   '<S90>/SC2'
   *   '<S91>/SC1'
   */
  boolean_T pooled18[8];
} ConstParam_sixstep_f28069mLaunc;

/* Real-time Model Data Structure */
struct tag_RTM_sixstep_f28069mLaunchPa {
  const char_T * volatile errorStatus;

  /*
   * Timing:
   * The following substructure contains information regarding
   * the timing information for the model.
   */
  struct {
    struct {
      uint16_T TID[5];
    } TaskCounters;
  } Timing;
};

/* Block signals (default storage) */
extern BlockIO_sixstep_f28069mLaunchPa sixstep_f28069mLaunchPad_clos_B;

/* Block states (default storage) */
extern D_Work_sixstep_f28069mLaunchPad sixstep_f28069mLaunchPad__DWork;
extern const ConstBlockIO_sixstep_f28069mLau sixstep_f28069mLaunchPad_ConstB;/* constant block i/o */

/* Constant parameters (default storage) */
extern const ConstParam_sixstep_f28069mLaunc sixstep_f28069mLaunchPad_ConstP;

/* External function called from main */
extern void sixstep_f28069mLaunchPad_closeLoop_SetEventsForThisBaseStep
  (boolean_T *eventFlags);

/* Model entry point functions */
extern void sixstep_f28069mLaunchPad_closeLoop_initialize(void);
extern void sixstep_f28069mLaunchPad_closeLoop_step0(void);
extern void sixstep_f28069mLaunchPad_closeLoop_step1(void);
extern void sixstep_f28069mLaunchPad_closeLoop_step2(void);
extern void sixstep_f28069mLaunchPad_closeLoop_step3(void);
extern void sixstep_f28069mLaunchPad_closeLoop_step4(void);
extern void sixstep_f28069mLaunchPad_closeLoop_terminate(void);

/* Real-time Model object */
extern RT_MODEL_sixstep_f28069mLaunchP *const sixstep_f28069mLaunchPad_clo_M;
extern volatile boolean_T stopRequested;
extern volatile boolean_T runModel;

#ifdef __cpluscplus

extern "C"
{

#endif

  interrupt void ADCINT1(void);
  void sixstep_f28069mLaunchPad_closeLoop_configure_interrupts (void);
  void sixstep_f28069mLaunchPad_closeLoop_unconfigure_interrupts (void);

#ifdef __cpluscplus

}

#endif

/*-
 * The generated code includes comments that allow you to trace directly
 * back to the appropriate location in the model.  The basic format
 * is <system>/block_name, where system is the system number (uniquely
 * assigned by Simulink) and block_name is the name of the block.
 *
 * Use the MATLAB hilite_system command to trace the generated code back
 * to the model.  For example,
 *
 * hilite_system('<S3>')    - opens system 3
 * hilite_system('<S3>/Kp') - opens and selects block Kp which resides in S3
 *
 * Here is the system hierarchy for this model
 *
 * '<Root>' : 'sixstep_f28069mLaunchPad_closeLoop'
 * '<S1>'   : 'sixstep_f28069mLaunchPad_closeLoop/ADC_INT1'
 * '<S2>'   : 'sixstep_f28069mLaunchPad_closeLoop/ControlButton'
 * '<S3>'   : 'sixstep_f28069mLaunchPad_closeLoop/Current Control'
 * '<S4>'   : 'sixstep_f28069mLaunchPad_closeLoop/SensorCalib'
 * '<S5>'   : 'sixstep_f28069mLaunchPad_closeLoop/Speed Control'
 * '<S6>'   : 'sixstep_f28069mLaunchPad_closeLoop/ToLCD'
 * '<S7>'   : 'sixstep_f28069mLaunchPad_closeLoop/ToggleLED'
 * '<S8>'   : 'sixstep_f28069mLaunchPad_closeLoop/ADC_INT1/HWI_ADCINT1'
 * '<S9>'   : 'sixstep_f28069mLaunchPad_closeLoop/ADC_INT1/HWI_ADCINT1/ECSoC'
 * '<S10>'  : 'sixstep_f28069mLaunchPad_closeLoop/ADC_INT1/HWI_ADCINT1/ECSoC/ECSimCodegen'
 * '<S11>'  : 'sixstep_f28069mLaunchPad_closeLoop/ControlButton/Direction'
 * '<S12>'  : 'sixstep_f28069mLaunchPad_closeLoop/ControlButton/ON//OFF'
 * '<S13>'  : 'sixstep_f28069mLaunchPad_closeLoop/ControlButton/Direction/readDirection'
 * '<S14>'  : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Control Signal'
 * '<S15>'  : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System'
 * '<S16>'  : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Data_Logging'
 * '<S17>'  : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Data_Transmit'
 * '<S18>'  : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Input Scaling'
 * '<S19>'  : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Sensor Driver Blocks'
 * '<S20>'  : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc'
 * '<S21>'  : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/Pos_Commutation'
 * '<S22>'  : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset'
 * '<S23>'  : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Anti-windup'
 * '<S24>'  : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/D Gain'
 * '<S25>'  : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Filter'
 * '<S26>'  : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Filter ICs'
 * '<S27>'  : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/I Gain'
 * '<S28>'  : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Ideal P Gain'
 * '<S29>'  : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Ideal P Gain Fdbk'
 * '<S30>'  : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Integrator'
 * '<S31>'  : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Integrator ICs'
 * '<S32>'  : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/N Copy'
 * '<S33>'  : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/N Gain'
 * '<S34>'  : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/P Copy'
 * '<S35>'  : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Parallel P Gain'
 * '<S36>'  : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Reset Signal'
 * '<S37>'  : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Saturation'
 * '<S38>'  : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Saturation Fdbk'
 * '<S39>'  : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Sum'
 * '<S40>'  : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Sum Fdbk'
 * '<S41>'  : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Tracking Mode'
 * '<S42>'  : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Tracking Mode Sum'
 * '<S43>'  : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Tsamp - Integral'
 * '<S44>'  : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Tsamp - Ngain'
 * '<S45>'  : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/postSat Signal'
 * '<S46>'  : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/preSat Signal'
 * '<S47>'  : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Anti-windup/Disc. Clamping Parallel'
 * '<S48>'  : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Anti-windup/Disc. Clamping Parallel/Dead Zone'
 * '<S49>'  : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Anti-windup/Disc. Clamping Parallel/Dead Zone/Enabled'
 * '<S50>'  : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/D Gain/Disabled'
 * '<S51>'  : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Filter/Disabled'
 * '<S52>'  : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Filter ICs/Disabled'
 * '<S53>'  : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/I Gain/External Parameters'
 * '<S54>'  : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Ideal P Gain/Passthrough'
 * '<S55>'  : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Ideal P Gain Fdbk/Disabled'
 * '<S56>'  : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Integrator/Discrete'
 * '<S57>'  : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Integrator ICs/External IC'
 * '<S58>'  : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/N Copy/Disabled wSignal Specification'
 * '<S59>'  : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/N Gain/Disabled'
 * '<S60>'  : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/P Copy/Disabled'
 * '<S61>'  : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Parallel P Gain/External Parameters'
 * '<S62>'  : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Reset Signal/External Reset'
 * '<S63>'  : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Saturation/Enabled'
 * '<S64>'  : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Saturation Fdbk/Disabled'
 * '<S65>'  : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Sum/Sum_PI'
 * '<S66>'  : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Sum Fdbk/Disabled'
 * '<S67>'  : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Tracking Mode/Disabled'
 * '<S68>'  : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Tracking Mode Sum/Passthrough'
 * '<S69>'  : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Tsamp - Integral/TsSignalSpecification'
 * '<S70>'  : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Tsamp - Ngain/Passthrough'
 * '<S71>'  : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/postSat Signal/Forward_Path'
 * '<S72>'  : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/preSat Signal/Forward_Path'
 * '<S73>'  : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/Pos_Commutation/Six Step Commutation'
 * '<S74>'  : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/Pos_Commutation/Six Step Commutation/HALL'
 * '<S75>'  : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/Pos_Commutation/Six Step Commutation/Position'
 * '<S76>'  : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/Pos_Commutation/Six Step Commutation/Sector2vector'
 * '<S77>'  : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/Pos_Commutation/Six Step Commutation/SwitchingSequence'
 * '<S78>'  : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/Pos_Commutation/Six Step Commutation/Position/PositionSectorvariant'
 * '<S79>'  : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/Pos_Commutation/Six Step Commutation/Position/PositionSectorvariant/Sector120'
 * '<S80>'  : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/Pos_Commutation/Six Step Commutation/Position/PositionSectorvariant/Sector120/Enabled Subsystem'
 * '<S81>'  : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/Pos_Commutation/Six Step Commutation/Position/PositionSectorvariant/Sector120/Enabled Subsystem1'
 * '<S82>'  : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/Pos_Commutation/Six Step Commutation/Position/PositionSectorvariant/Sector120/Enabled Subsystem2'
 * '<S83>'  : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/Pos_Commutation/Six Step Commutation/Position/PositionSectorvariant/Sector120/Enabled Subsystem3'
 * '<S84>'  : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/Pos_Commutation/Six Step Commutation/Position/PositionSectorvariant/Sector120/Enabled Subsystem4'
 * '<S85>'  : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/Pos_Commutation/Six Step Commutation/Position/PositionSectorvariant/Sector120/Enabled Subsystem5'
 * '<S86>'  : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/Pos_Commutation/Six Step Commutation/Position/PositionSectorvariant/Sector120/Enabled Subsystem6'
 * '<S87>'  : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/Pos_Commutation/Six Step Commutation/Sector2vector/Bit Extract'
 * '<S88>'  : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/Pos_Commutation/Six Step Commutation/Sector2vector/Default '
 * '<S89>'  : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/Pos_Commutation/Six Step Commutation/Sector2vector/Bit Extract/Extract Bits'
 * '<S90>'  : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/Pos_Commutation/Six Step Commutation/SwitchingSequence/negative'
 * '<S91>'  : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/Pos_Commutation/Six Step Commutation/SwitchingSequence/positive'
 * '<S92>'  : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Data_Logging/Counter Limited'
 * '<S93>'  : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Data_Logging/Data'
 * '<S94>'  : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Data_Logging/Data_Conditioning'
 * '<S95>'  : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Data_Logging/End'
 * '<S96>'  : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Data_Logging/Start'
 * '<S97>'  : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Data_Logging/Counter Limited/Increment Real World'
 * '<S98>'  : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Data_Logging/Counter Limited/Wrap To Zero'
 * '<S99>'  : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Data_Transmit/CodeGeneration'
 * '<S100>' : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Input Scaling/Convert ADC value to PU'
 * '<S101>' : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Input Scaling/QEP Feedback'
 * '<S102>' : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Input Scaling/Convert ADC value to PU/LowerSwitchCurrents'
 * '<S103>' : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Input Scaling/QEP Feedback/ Calculate Position and Speed'
 * '<S104>' : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Input Scaling/QEP Feedback/ Calculate Position and Speed/IIR Filter'
 * '<S105>' : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Input Scaling/QEP Feedback/ Calculate Position and Speed/Mechanical to Electrical Position'
 * '<S106>' : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Input Scaling/QEP Feedback/ Calculate Position and Speed/Quadrature Decoder'
 * '<S107>' : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Input Scaling/QEP Feedback/ Calculate Position and Speed/Speed Measurement'
 * '<S108>' : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Input Scaling/QEP Feedback/ Calculate Position and Speed/IIR Filter/IIR Filter'
 * '<S109>' : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Input Scaling/QEP Feedback/ Calculate Position and Speed/IIR Filter/IIR Filter/Low-pass'
 * '<S110>' : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Input Scaling/QEP Feedback/ Calculate Position and Speed/IIR Filter/IIR Filter/Low-pass/IIR Low Pass Filter'
 * '<S111>' : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Input Scaling/QEP Feedback/ Calculate Position and Speed/Mechanical to Electrical Position/MechToElec'
 * '<S112>' : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Input Scaling/QEP Feedback/ Calculate Position and Speed/Mechanical to Electrical Position/MechToElec/floating-point'
 * '<S113>' : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Input Scaling/QEP Feedback/ Calculate Position and Speed/Mechanical to Electrical Position/MechToElec/floating-point/Compensate Offset'
 * '<S114>' : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Input Scaling/QEP Feedback/ Calculate Position and Speed/Mechanical to Electrical Position/MechToElec/floating-point/Mech To Elec'
 * '<S115>' : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Input Scaling/QEP Feedback/ Calculate Position and Speed/Mechanical to Electrical Position/MechToElec/floating-point/Compensate Offset/If Action Subsystem'
 * '<S116>' : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Input Scaling/QEP Feedback/ Calculate Position and Speed/Mechanical to Electrical Position/MechToElec/floating-point/Compensate Offset/If Action Subsystem1'
 * '<S117>' : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Input Scaling/QEP Feedback/ Calculate Position and Speed/Mechanical to Electrical Position/MechToElec/floating-point/Mech To Elec/Variant Subsystem'
 * '<S118>' : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Input Scaling/QEP Feedback/ Calculate Position and Speed/Mechanical to Electrical Position/MechToElec/floating-point/Mech To Elec/Variant Subsystem/Dialog'
 * '<S119>' : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Input Scaling/QEP Feedback/ Calculate Position and Speed/Quadrature Decoder/DT_Handle'
 * '<S120>' : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Input Scaling/QEP Feedback/ Calculate Position and Speed/Quadrature Decoder/PositionNoReset'
 * '<S121>' : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Input Scaling/QEP Feedback/ Calculate Position and Speed/Quadrature Decoder/PositionResetAtIndex'
 * '<S122>' : 'sixstep_f28069mLaunchPad_closeLoop/Current Control/Input Scaling/QEP Feedback/ Calculate Position and Speed/Quadrature Decoder/Variant Subsystem'
